OpenFOAM files/run/streetcanyon_perpendicular/LoD2/LAD02/conifer/0/leafAreaDensity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      leafAreaDensity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField  uniform  0.0;


boundaryField
{
    y1
    {
        type            fixedValue;
        value           $internalField;
    }

    y0
    {
        type            fixedValue;
        value           $internalField;
    }

    wall
    {
        type            fixedValue;
        value           $internalField;
    }
    
    #include "include/sideAndTopPatches"
}

// ************************************************************************* //

